
# Error messages for IBM SPSS Statistics-R plug-in
# The numbers indicate the error level
# The strings after "=" indicate the error message
# [okay]_, [warning]_, [error]_, [RError]_ are part of keys
# Don't translate them.

# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_NONE

# Errors come from IBM SPSS Statistics backend.
[ok]_0 = Aucune erreur.
[ok]_1 = Commentaire.
[warning]_2 = Avertissement.
[error]_3 = Erreur grave.
[error]_4 = Erreur fatale.
[error]_5 = Erreur catastrophique.
[error]_6 = Erreur de syntaxe de commande.
[error]_401 = Index non valide.
[error]_11 = Impossible d'ajouter l'objet \u00e0 l'espace de travail XML.
[error]_12 = Objet de descripteur non valide.
[error]_13 = Impossible de supprimer l'objet d'espace de travail XML.
[error]_15 = Impossible d'obtenir le r\u00e9sultat.
[error]_16 = Valeur non valide.
[warning]_20 = Un descripteur d'espace de travail XML existant a \u00e9t\u00e9 supprim\u00e9 et remplac\u00e9.
[error]_21 = Expression XPath non valide.
[error]_22 = Erreur XML.
[warning]_23 = Impossible de lire plus de donn\u00e9es.
[error]_24 = Type de donn\u00e9es non valide.
[error]_25 = Nom de variable en double.
[error]_26 = Type de variable non valide.
[error]_27 = Nom de variable non valide.
[error]_30 = Observation non valide.
[error]_31 = Impossible de compl\u00e9ter cette action si une connexion de donn\u00e9es pour le traitement des fichiers scind\u00e9s est ouverte.
[error]_32 = Une proc\u00e9dure utilisateur est en cours d'ex\u00e9cution.
[error]_34 = Niveau de mesure non valide.
[error]_36 = Format de valeur manquante non valide.
[error]_40 = Une source de donn\u00e9es de proc\u00e9dure est requise.
[error]_44 = Le jeu de donn\u00e9es actif est vide.
[error]_47 = Type de format non valide.
[error]_48 = Format de largeur non valide.
[error]_49 = S\u00e9parateur d\u00e9cimal non valide.
[error]_54 = Plus de donn\u00e9es disponibles dans le jeu de donn\u00e9es actif.
[error]_56 = Seules les variables de cha\u00eene sont autoris\u00e9es.
[error]_57 = Seules les variables num\u00e9riques sont autoris\u00e9es.
[error]_58 = Nom d'attribut non valide.
[error]_59 = Les valeurs manquantes de l'utilisateur pour les variables de cha\u00eene doivent \u00eatre \u00e9gales ou inf\u00e9rieures \u00e0 8 caract\u00e8res.
[error]_61 = La valeur des donn\u00e9es est trop longue.
[error]_62 = La longueur d\u00e9finie de la variable de cha\u00eene ne doit pas d\u00e9passer 32\u00a0767 octets.
[error]_64 = Impossible de modifier les valeurs de donn\u00e9es ou les informations sur la variable dans le jeu de donn\u00e9es d'origine.
[warning]_67 = La fin de la scission actuelle a \u00e9t\u00e9 atteinte.
[error]_70 = Le libell\u00e9 est trop long.
[error]_71 = La valeur est trop longue.
[error]_82 = La variable ne se trouve pas dans le jeu de donn\u00e9es actif.
[error]_86 = Une source de donn\u00e9s active est requise pour compl\u00e9ter cette action.
[error]_87 = Nom du jeu de donn\u00e9es non valide.
[error]_88 = Cette m\u00e9thode ne peut \u00eatre appel\u00e9e qu'entre SetDictionaryToSPSS et EndDataStep.
[error]_89 = Appel de fonction non valide. La fonction ne peut \u00eatre appel\u00e9e que pendant la cr\u00e9ation du jeu de donn\u00e9es ou dans une proc\u00e9dure utilisateur.
[error]_90 = Impossible de cr\u00e9er un jeu de donn\u00e9es actif dans une proc\u00e9dure utilisateur.
[error]_91 = Un jeu de donn\u00e9es avec le nom sp\u00e9cifi\u00e9 existe d\u00e9j\u00e0.
[error]_92 = Impossible de compl\u00e9ter cette action si la cr\u00e9ation du jeu de donn\u00e9es est en cours.
[error]_94 = Impossible de cr\u00e9er un jeu de donn\u00e9es alors que des transformations sont en attente.
[error]_96 = Impossible de trouver le nom d'attribut sp\u00e9cifi\u00e9.
[error]_99 = Impossible de cr\u00e9er le jeu de donn\u00e9es sp\u00e9cifi\u00e9.
[error]_100 = D\u00e9finition de l'ensemble de r\u00e9ponses multiples non valide.
[error]_301 = Aucun mod\u00e8le dans le noeud applicateur CF. V\u00e9rifiez SetModel dans le noeud cr\u00e9ation.
[error]_402 = Index de champ non valide.
[warning]_404 = Le champ n'a pas de libell\u00e9s.
[warning]_403 = Les valeurs et les libell\u00e9s de champ ne correspondent pas.
[error]_999999997 = Erreur inconnue.
[error]_999999998 = Le traitement a \u00e9t\u00e9 interrompu par l'utilisateur.
[error]_999999999 = Erreur inconnue.

# Errors come from R plug-in.
#[warning]_1000 = There are no more split groups.
## data model
[RError]_1001 = Format de mod\u00e8le de donn\u00e9es de composant R CF non valide.
[RError]_1002 = Nom de champ non valide dans le mod\u00e8le de donn\u00e9es. Des valeurs en double sont pr\u00e9sentes.
[warning]_1003 = Des valeurs en double sont pr\u00e9sentes pour les libell\u00e9s de valeur.
[RError]_1004 = Stockage de champ non valide pour SetDataModel.
[RError]_1005 = Mesure non valide pour SetDataModel.
[RError]_1006 = Format de champ non valide pour SetDataModel.
[RError]_1007 = R\u00f4le de champ non valide pour SetDataModel.

[RError]_1021 = Valeur manquante de champ non valide.
##this is for GetDataModel or GetData
[RError]_1020 = Nom de champ non valide dans l'argument.

## data
[RError]_1008 = Valeur non valide pour l'argument factorMode (doit \u00eatre "none", "levels" ou "labels").
[RError]_1009 = Valeur non valide pour l'argument rDate (doit \u00eatre "none", "POSIXct" ou "POSIXlt").
[RError]_1010 = Valeur non valide pour l'argument missingValue (doit \u00eatre NA, NaN ou "asis").
[RError]_1011 = Appel de fonction non valide. La fonction ne peut \u00eatre appel\u00e9e que lorsque SetDataModel a \u00e9t\u00e9 appel\u00e9e.
[RError]_1012 = Les donn\u00e9es et le mod\u00e8le de donn\u00e9es ne correspondent pas.

[RError]_1013 = Index non valide pour GetOutputsNames.
[RError]_1014 = Nom ou chemin de graphique non valide.
[RError]_1015 = Format de graphique non valide (doit \u00eatre "JPG", "PNG" ou "BMP").
[RError]_1016 = Attend un argument num\u00e9rique.
[RError]_1017 = Attend un argument entier.
[RError]_1018 = Attend un argument bool\u00e9en.
[RError]_1019 = Les variables d'argument doivent \u00eatre une cha\u00eene, un vecteur ou une liste.

# General errors
SPSSError = Erreur d'IBM SPSS CF
SPSSWarning = Avertissement d'IBM SPSS CF
error_code = Le code d'erreur est
with_message = avec le message
