
# Error messages for IBM SPSS Statistics-R plug-in
# The numbers indicate the error level
# The strings after "=" indicate the error message
# [okay]_, [warning]_, [error]_, [RError]_ are part of keys
# Don't translate them.

# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_NONE

# Errors come from IBM SPSS Statistics backend.
[ok]_0 = \u30a8\u30e9\u30fc\u306f\u3042\u308a\u307e\u305b\u3093\u3002
[ok]_1 = \u30b3\u30e1\u30f3\u30c8\u3002
[warning]_2 = \u8b66\u544a\u3002
[error]_3 = \u6df1\u523b\u306a\u30a8\u30e9\u30fc\u3002
[error]_4 = \u81f4\u547d\u7684\u306a\u30a8\u30e9\u30fc\u3002
[error]_5 = \u58ca\u6ec5\u7684\u306a\u30a8\u30e9\u30fc\u3002
[error]_6 = \u30b3\u30de\u30f3\u30c9 \u30b7\u30f3\u30bf\u30c3\u30af\u30b9\u306e\u30a8\u30e9\u30fc
[error]_401 = \u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_11 = \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092 XML \u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u8ffd\u52a0\u3067\u304d\u307e\u305b\u3093\u3002
[error]_12 = \u30cf\u30f3\u30c9\u30eb \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_13 = XML \u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
[error]_15 = \u7d50\u679c\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
[error]_16 = \u5024\u304c\u7121\u52b9\u3067\u3059\u3002
[warning]_20 = \u65e2\u5b58\u306e XML \u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9 \u30cf\u30f3\u30c9\u30eb\u304c\u4e0a\u66f8\u304d\u3055\u308c\u307e\u3057\u305f\u3002
[error]_21 = XPath \u5f0f\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_22 = XML \u30a8\u30e9\u30fc\u3002
[warning]_23 = \u3053\u308c\u4ee5\u4e0a\u30c7\u30fc\u30bf\u3092\u8aad\u307f\u8fbc\u3080\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
[error]_24 = \u30c7\u30fc\u30bf\u578b\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_25 = \u5909\u6570\u540d\u304c\u91cd\u8907\u3057\u3066\u3044\u307e\u3059\u3002
[error]_26 = \u5909\u6570\u306e\u578b\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_27 = \u5909\u6570\u540d\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_30 = \u30b1\u30fc\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_31 = "\u5206\u5272\u30d5\u30a1\u30a4\u30eb\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306e\u30c7\u30fc\u30bf\u63a5\u7d9a\u304c\u958b\u3044\u3066\u3044\u308b\u9593\u306f\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002
[error]_32 = \u30e6\u30fc\u30b6\u30fc\u624b\u9806\u304c\u5b9f\u884c\u4e2d\u3067\u3059\u3002
[error]_34 = \u6e2c\u5b9a\u306e\u5c3a\u5ea6\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_36 = \u6b20\u640d\u5024\u306e\u5f62\u5f0f\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_40 = \u624b\u7d9a\u304d\u30c7\u30fc\u30bf \u30bd\u30fc\u30b9\u304c\u5fc5\u8981\u3067\u3059\u3002
[error]_44 = \u30a2\u30af\u30c6\u30a3\u30d6 \u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u304c\u7a7a\u3067\u3059\u3002
[error]_47 = \u5f62\u5f0f\u306e\u30bf\u30a4\u30d7\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_48 = \u5f62\u5f0f\u306e\u5e45\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_49 = \u5c0f\u6570\u70b9\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_54 = \u30a2\u30af\u30c6\u30a3\u30d6 \u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u306b\u306f\u3001\u3053\u308c\u4ee5\u4e0a\u4f7f\u7528\u53ef\u80fd\u306a\u30c7\u30fc\u30bf\u306f\u3042\u308a\u307e\u305b\u3093\u3002
[error]_56 = \u4f7f\u7528\u3067\u304d\u308b\u306e\u306f\u6587\u5b57\u5217\u5909\u6570\u3060\u3051\u3067\u3059\u3002
[error]_57 = \u4f7f\u7528\u3067\u304d\u308b\u306e\u306f\u6570\u5024\u5909\u6570\u3060\u3051\u3067\u3059\u3002
[error]_58 = \u5c5e\u6027\u540d\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_59 = \u6587\u5b57\u5217\u5909\u6570\u306e\u30e6\u30fc\u30b6\u30fc\u6b20\u640d\u5024\u306e\u9577\u3055\u306f 8 \u6587\u5b57\u4ee5\u4e0b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
[error]_61 = \u30c7\u30fc\u30bf\u5024\u304c\u9577\u3059\u304e\u307e\u3059\u3002
[error]_62 = \u6587\u5b57\u5217\u5909\u6570\u306e\u9577\u3055\u306f\u300132767 \u30d0\u30a4\u30c8\u3092\u8d85\u3048\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
[error]_64 = \u5143\u306e\u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u306e\u30c7\u30fc\u30bf\u5024\u3084\u5909\u6570\u60c5\u5831\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
[warning]_67 = \u73fe\u5728\u306e\u5206\u5272\u306e\u6700\u5f8c\u306b\u5230\u9054\u3057\u307e\u3057\u305f\u3002
[error]_70 = \u30e9\u30d9\u30eb\u306e\u9577\u3055\u304c\u9577\u3059\u304e\u307e\u3059\u3002
[error]_71 = \u5024\u306e\u9577\u3055\u304c\u9577\u3059\u304e\u307e\u3059\u3002
[error]_82 = \u30a2\u30af\u30c6\u30a3\u30d6 \u30c7\u30fc\u30bf\u30bb\u30c3\u30c8\u306b\u5909\u6570\u304c\u3042\u308a\u307e\u305b\u3093\u3002
[error]_86 = \u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u306b\u306f\u30a2\u30af\u30c6\u30a3\u30d6 \u30c7\u30fc\u30bf \u30bd\u30fc\u30b9\u304c\u5fc5\u8981\u3067\u3059\u3002
[error]_87 = \u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u540d\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_88 = \u3053\u306e\u30e1\u30bd\u30c3\u30c9\u306f SetDictionaryToSPSS \u3068 EndDataStep \u306e\u9593\u3067\u306e\u307f\u547c\u3073\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
[error]_89 = \u95a2\u6570\u547c\u3073\u51fa\u3057\u304c\u7121\u52b9\u3067\u3059\u3002 \u95a2\u6570\u306f\u3001\u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u4f5c\u6210\u6642\u3001\u307e\u305f\u306f\u30e6\u30fc\u30b6\u30fc\u624b\u9806\u3067\u306e\u307f\u547c\u3073\u51fa\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
[error]_90 = \u30e6\u30fc\u30b6\u30fc\u624b\u9806\u5185\u3067\u30a2\u30af\u30c6\u30a3\u30d6 \u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
[error]_91 = \u540c\u3058\u540d\u524d\u306e\u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u304c\u3059\u3067\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
[error]_92 = \u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u306e\u4f5c\u6210\u4e2d\u306f\u3001\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
[error]_94 = \u4fdd\u7559\u4e2d\u306e\u5909\u63db\u304c\u3042\u308b\u5834\u5408\u3001\u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
[error]_96 = \u6307\u5b9a\u3055\u308c\u305f\u5c5e\u6027\u540d\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
[error]_99 = \u6307\u5b9a\u3055\u308c\u305f\u30c7\u30fc\u30bf \u30bb\u30c3\u30c8\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3002
[error]_100 = \u591a\u91cd\u56de\u7b54\u30bb\u30c3\u30c8\u306e\u5b9a\u7fa9\u304c\u7121\u52b9\u3067\u3059\u3002
[error]_301 = CF \u30a2\u30d7\u30e9\u30a4\u30e4\u30fc \u30ce\u30fc\u30c9\u306b\u30e2\u30c7\u30eb\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u30d3\u30eb\u30c0\u30fc \u30ce\u30fc\u30c9\u306e SetModel \u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
[error]_402 = \u30d5\u30a3\u30fc\u30eb\u30c9 \u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
[warning]_404 = \u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u30e9\u30d9\u30eb\u304c\u3042\u308a\u307e\u305b\u3093\u3002
[warning]_403 = \u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u30e9\u30d9\u30eb\u3068\u5024\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
[error]_999999997 = \u4e0d\u660e\u306a\u30a8\u30e9\u30fc\u3002
[error]_999999998 = \u51e6\u7406\u304c\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u3063\u3066\u4e2d\u65ad\u3055\u308c\u307e\u3057\u305f\u3002
[error]_999999999 = \u4e0d\u660e\u306a\u30a8\u30e9\u30fc\u3002

# Errors come from R plug-in.
#[warning]_1000 = There are no more split groups.
## data model
[RError]_1001 = R CF \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u5f62\u5f0f\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1002 = \u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u5185\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u304c\u7121\u52b9\u3067\u3059\u3002 \u91cd\u8907\u3057\u305f\u5024\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
[warning]_1003 = \u5024\u306e\u30e9\u30d9\u30eb\u3067\u91cd\u8907\u3057\u305f\u5024\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
[RError]_1004 = SetDataModel \u306e\u30d5\u30a3\u30fc\u30eb\u30c9 \u30b9\u30c8\u30ec\u30fc\u30b8\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1005 = SetDataModel \u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u6307\u6a19\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1006 = SetDataModel \u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u5f62\u5f0f\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1007 = SetDataModel \u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5f79\u5272\u304c\u7121\u52b9\u3067\u3059\u3002


##this is for GetDataModel or GetData
[RError]_1020 = \u5f15\u6570\u5185\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u540d\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1021 = \u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u6b20\u640d\u5024\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1022 = \u30d5\u30e9\u30b0\u578b\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u5024\u304c\u3042\u308a\u307e\u305b\u3093\u3002

## data
[RError]_1008 = \u5f15\u6570 factorMode \u306e\u5024\u304c\u7121\u52b9\u3067\u3059 (\u300cnone\u300d\u3001\u300clevels\u300d\u3001\u300clabels\u300d\u306e\u3044\u305a\u308c\u304b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093)\u3002
[RError]_1009 = \u5f15\u6570 rDate \u306e\u5024\u304c\u7121\u52b9\u3067\u3059 (\u300cnone\u300d\u3001\u300cPOSIXct\u300d\u3001\u300cPOSIXlt\u300d\u306e\u3044\u305a\u308c\u304b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093)\u3002
[RError]_1010 = \u5f15\u6570 missingValue \u306e\u5024\u304c\u7121\u52b9\u3067\u3059 (NA\u3001NaN\u3001\u300casis\u300d\u306e\u3044\u305a\u308c\u304b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093)\u3002
[RError]_1011 = \u95a2\u6570\u547c\u3073\u51fa\u3057\u304c\u7121\u52b9\u3067\u3059\u3002 \u95a2\u6570\u3092\u547c\u3073\u51fa\u3059\u306b\u306f\u3001\u6700\u521d\u306b SetDataModel \u3092\u547c\u3073\u51fa\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
[RError]_1012 = \u30c7\u30fc\u30bf\u3068\u30c7\u30fc\u30bf \u30e2\u30c7\u30eb\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002

[RError]_1013 = GetOutputsNames \u306e\u30a4\u30f3\u30c7\u30c3\u30af\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1014 = \u30b0\u30e9\u30d5\u30a3\u30c3\u30af\u540d\u307e\u305f\u306f\u30d1\u30b9\u304c\u7121\u52b9\u3067\u3059\u3002
[RError]_1015 = \u30b0\u30e9\u30d5\u30a3\u30c3\u30af\u306e\u5f62\u5f0f\u304c\u7121\u52b9\u3067\u3059 (\u300cJPG\u300d\u3001\u300cPNG\u300d\u3001\u300cBMP\u300d\u306e\u3044\u305a\u308c\u304b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093)\u3002
[RError]_1016 = \u6570\u5024\u578b\u306e\u5f15\u6570\u304c\u5fc5\u8981\u3067\u3059\u3002
[RError]_1017 = \u6574\u6570\u306e\u5f15\u6570\u304c\u5fc5\u8981\u3067\u3059\u3002
[RError]_1018 = \u30d6\u30fc\u30eb\u578b\u306e\u5f15\u6570\u304c\u5fc5\u8981\u3067\u3059\u3002
[RError]_1019 = \u5f15\u6570\u306e\u5909\u6570\u306f\u3001\u6587\u5b57\u5217\u3001\u30d9\u30af\u30c8\u30eb\u3001\u307e\u305f\u306f\u30ea\u30b9\u30c8\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002

# General errors
SPSSError = IBM SPSS CF \u30a8\u30e9\u30fc
SPSSWarning = IBM SPSS CF \u8b66\u544a
error_code = \u30a8\u30e9\u30fc \u30b3\u30fc\u30c9
with_message = \u30e1\u30c3\u30bb\u30fc\u30b8\u3042\u308a
