
# Error messages for IBM SPSS Statistics-R plug-in
# The numbers indicate the error level
# The strings after "=" indicate the error message
# [okay]_, [warning]_, [error]_, [RError]_ are part of keys
# Don't translate them.

# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_NONE

# Errors come from IBM SPSS Statistics backend.
[ok]_0 = Ning\u00fan error.
[ok]_1 = Comentario.
[warning]_2 = Aviso.
[error]_3 = Error grave.
[error]_4 = Error muy grave.
[error]_5 = Error catastr\u00f3fico.
[error]_6 = Error de sintaxis del mandato.
[error]_401 = \u00cdndice no v\u00e1lido.
[error]_11 = No se puede agregar un objeto al espacio de trabajo XML.
[error]_12 = Objeto de controlador no v\u00e1lido.
[error]_13 = No se puede eliminar el objeto del espacio de trabajo XML.
[error]_15 = No se puede obtener el resultado.
[error]_16 = Valor no v\u00e1lido.
[warning]_20 = Se ha sobrescrito un controlador de un espacio de trabajo XML existente.
[error]_21 = Expresi\u00f3n XPath no v\u00e1lida.
[error]_22 = Error de XML.
[warning]_23 = No se pueden leer m\u00e1s datos.
[error]_24 = Tipo de datos no v\u00e1lido.
[error]_25 = Nombre de variable duplicado.
[error]_26 = Tipo de variable no v\u00e1lida.
[error]_27 = Nombre de variable no v\u00e1lido.
[error]_30 = Caso no v\u00e1lido.
[error]_31 = No se puede completar esta acci\u00f3n mientras est\u00e9 abierta una conexi\u00f3n de datos para procesar archivos divididos.
[error]_32 = Se est\u00e1 ejecutando un procedimiento de usuario.
[error]_34 = Nivel de medici\u00f3n no v\u00e1lido.
[error]_36 = Formato de valor perdido no v\u00e1lido.
[error]_40 = Se requiere un origen de datos de procedimiento.
[error]_44 = El conjunto de datos activo est\u00e1 vac\u00edo.
[error]_47 = Tipo de formato no v\u00e1lido.
[error]_48 = Ancho de formato no v\u00e1lido.
[error]_49 = Separador decimal no v\u00e1lido.
[error]_54 = No hay m\u00e1s datos disponibles en el conjunto de datos activo.
[error]_56 = S\u00f3lo se permiten variables de cadena.
[error]_57 = S\u00f3lo se permiten variables num\u00e9ricas.
[error]_58 = Nombre de atributo no v\u00e1lido.
[error]_59 = La longitud de un valor perdido del usuario para una variable de cadena debe ser de 8 caracteres o menos.
[error]_61 = El valor de datos es demasiado largo.
[error]_62 = La longitud de una variable de cadena no puede exceder 32767 bytes.
[error]_64 = No se pueden cambiar valores de datos o informaci\u00f3n de variable en el conjunto de datos original.
[warning]_67 = Se ha alcanzado el final de la divisi\u00f3n actual.
[error]_70 = La longitud de la etiqueta es demasiado larga.
[error]_71 = La longitud del valor es demasiado larga.
[error]_82 = La variable no est\u00e1 en el conjunto de datos activo.
[error]_86 = Se requiere un origen de datos activo para completar esta acci\u00f3n.
[error]_87 = Nombre de conjunto de datos no v\u00e1lido.
[error]_88 = S\u00f3lo se puede llamar a este m\u00e9todo entre SetDictionaryToSPSS y EndDataStep.
[error]_89 = Llamada a funci\u00f3n no v\u00e1lida. S\u00f3lo se puede llamar a la funci\u00f3n durante la creaci\u00f3n del conjunto de datos o en un procedimiento de usuario.
[error]_90 = No se puede crear un conjunto de datos activo en un procedimiento de usuario.
[error]_91 = Ya existe un conjunto de datos con el mismo nombre.
[error]_92 = No se puede completar esta acci\u00f3n mientras est\u00e1 en curso la creaci\u00f3n del conjunto de datos.
[error]_94 = No se puede crear un conjunto de datos mientras hay transformaciones pendientes.
[error]_96 = No se puede encontrar el nombre de atributo especificado.
[error]_99 = No se puede crear el conjunto de datos especificado.
[error]_100 = Definici\u00f3n de conjunto de respuesta m\u00faltiples no v\u00e1lida.
[error]_301 = No hay ning\u00fan modelo en el nodo aplicador de CF, aseg\u00farese de definir el Modelo en el nodo Generador.
[error]_402 = \u00cdndice de campos no v\u00e1lido.
[warning]_404 = El campo no tiene etiquetas.
[warning]_403 = Las etiquetas y los valores de campo no coinciden.
[error]_999999997 = Error desconocido.
[error]_999999998 = El proceso ha sido interrumpido por el usuario.
[error]_999999999 = Error desconocido.

# Errors come from R plug-in.
#[warning]_1000 = There are no more split groups.
## data model
[RError]_1001 = Formato de modelo de datos de componente CF de R no v\u00e1lido.
[RError]_1002 = Nombre de campo no v\u00e1lido en el modelo de datos. Hay valores duplicados.
[warning]_1003 = Hay valores duplicados en las etiquetas de valor.
[RError]_1004 = Almacenamiento de campo no v\u00e1lido para SetDataModel.
[RError]_1005 = Medida de campo no v\u00e1lida para SetDataModel.
[RError]_1006 = Formato de campo no v\u00e1lido para SetDataModel.
[RError]_1007 = Rol de campo no v\u00e1lido para SetDataModel.


##this is for GetDataModel or GetData
[RError]_1020 = Nombre de campo no v\u00e1lido en el argumento.
[RError]_1021 = Valor perdido de campo no v\u00e1lido.
[RError]_1022 = El campo de distintivo no tiene valores.

## data
[RError]_1008 = Valor no v\u00e1lido para el argumento factorMode (debe ser "none", "levels" o "labels").
[RError]_1009 = Valor no v\u00e1lido para el argumento rDate (debe ser "none", "POSIXct" o "POSIXlt").
[RError]_1010 = Valor no v\u00e1lido para el argumento missingValue (debe ser NA, NaN o "asis").
[RError]_1011 = Llamada a funci\u00f3n no v\u00e1lida. S\u00f3lo se puede llamar a la funci\u00f3n despu\u00e9s de llamar a SetDataModel.
[RError]_1012 = Los datos y el modelo de datos no coinciden.

[RError]_1013 = \u00cdndice no v\u00e1lido para GetOutputsNames.
[RError]_1014 = Nombre o ruta de gr\u00e1fico no v\u00e1lido.
[RError]_1015 = Formato de gr\u00e1fico no v\u00e1lido (debe ser "JPG", "PNG" o "BMP").
[RError]_1016 = Se espera un argumento num\u00e9rico.
[RError]_1017 = Se espera un argumento de entero.
[RError]_1018 = Se espera un argumento booleano.
[RError]_1019 = Las variables de argumento deben ser cadenas, vectores o listas.

# General errors
SPSSError = Error de IBM SPSS CF
SPSSWarning = Aviso de IBM SPSS CF
error_code = El c\u00f3digo de error es
with_message = Con el mensaje
